/*В форке личного проекта создайте ветку module8-task2 и в ней создайте файл js/inherit.js. В этом файле объявите в глобальной области видимости функцию inherit(child: Function, parent: Function), которая принимает на два конструктора и записывает в прототип дочернего конструктора child методы и свойства родительского конструктора parent через пустой конструктор.*/
/* global inherit: true */

/**
 * Принимает два конструктора и записывает в прототип
 * дочернего конструктора child методы и свойства родительского конструктора parent
 * через пустой конструктор
 * @param {Function} child
 * @param {Function} parent
 */

function inherit(child, parent) {
    
}
